app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" ORDER BY priority_number desc
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "8"]]
---
  def index
    @groups = Group.all
    @group = Group.new
    @groups = Group.find(:all, :conditions => {:user_id => current_user})

    @users= User.all
    @shared_friendships = FriendshipAppointment.all
    @shared_friendship = FriendshipAppointment.new
    @shared_friendships = FriendshipAppointment.find(:all, :conditions => {:user_id => current_user})




   #ordnet inhalte je nach spalte
    @appointments = Appointment.order(sort_column + " " + sort_direction)

    @appointment = Appointment.new

    ##### Admin rechte verwalten
    if current_user.admin?
      #admin darf alle termine sehen und verwalten und nach user sortieren

    else
      #wenn der User kein Admin ist, werden nur com user angelegte Termine gezeigt
      @appointments = Appointment.find(:all, :conditions => {:user_id => current_user})
    end
    #################
    # Diese Zeile verursacht, dass jeder User die Termine aller anderenuser sehen kann
    # Wenn man diese zeile nach oben verschiebt funktioniert sie allerdings nicht mehr =((
    @appointments = Appointment.search(params[:search])
    #################

    respond_to do |format|
      format.html # index.html.erb
      format.json { render json: @appointments, :notice => 'Appointment in index.' }
    end
    end



  def zeit
    puts "HEYHOHELLO"
  end
  # GET /appointments/1
  # GET /appointments/1.json
  def show
    @users= User.all
    @shared_friendships = FriendshipAppointment.all
    @shared_friendship = FriendshipAppointment.new

    @appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @groups = Group.all
    @group = Group.new
    @shared_friendships = FriendshipAppointment.all
    @shared_friendship = FriendshipAppointment.new

    @appointment = Appointment.find(params[:id])

INSERT INTO "appointments" ("created_at", "date", "note", "priority_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 25 Nov 2011 12:07:08 UTC +00:00], ["date", Sat, 26 Nov 2011 12:00:00 UTC +00:00], ["note", "gh"], ["priority_number", 0], ["updated_at", Fri, 25 Nov 2011 12:07:08 UTC +00:00]]
---
  def create

      #@appointment = Appointment.new(params[:appointment].merge(:user =>current_user )) #user id mit user verknüpfen
      @appointment = Appointment.new(params[:appointment])


      if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "appointments" SET "note" = 'Fußball spielen mit den Jungs, danach nochn Bierchen im Vereinslokal klingt gut', "priority_number" = 0, "updated_at" = '2011-11-25 16:03:47.453945' WHERE "appointments"."id" = 5
---
  def update
    @appointment = Appointment.find(params[:id])

    respond_to do |format|
      if @appointment.update_attributes(params[:appointment])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "12"]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 12]]
---
  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy