app/controllers/users_controller.rb

  def index
    @group = Group.new
    @groups = Group.find(:all, :conditions => {:user_id => current_user})

    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @group = Group.new
    @groups = Group.find(:all, :conditions => {:user_id => current_user})

    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @group = Group.new
    @groups = Group.find(:all, :conditions => {:user_id => current_user})
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.new(params[:user])

    # Saving without session maintenance to skip
    # auto-login which can't happen here because
    # the User has not yet been activated
    if @user.save_without_session_maintenance
---
INSERT INTO "users" ("created_at", "crypted_password", "current_login_at", "current_login_ip", "email", "failed_login_count", "last_login_at", "last_login_ip", "last_request_at", "login", "login_count", "password_salt", "perishable_token", "persistence_token", "single_access_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "users" SET "password_salt" = '7KYaIaUyXTfEd5AYwjGA', "crypted_password" = 'ceec522994c14c152bd8857f1b7b8ef0', "persistence_token" = '768ce0670d3c1ea07d1d737559ed3e41c2f50b25a9064255210791e9279e49a3f2d04ce28bb6de057416b8cc531e72f73dbabeb2da2b90e0f64513da6f747ab1', "perishable_token" = 'Of1fqgGaqpaksTwZcRZ', "last_request_at" = '2011-12-03 20:08:02.794933', "login_count" = 2, "last_login_at" = '2011-12-03 20:04:05.771656', "current_login_at" = '2011-12-03 20:08:02.794761', "last_login_ip" = '127.0.0.1', "updated_at" = '2011-12-03 20:08:02.795373' WHERE "users"."id" = 2